
# -*- encoding: utf-8 -*-


CYRILLIC_MAP = {
    u'а': 'a',
    u'б': 'b',
    u'в': 'b',
    u'г': 'g',
    u'ґ': 'g',
    u'д': 'd',
    u'е': 'e',
    u'є': 'e',
    u'ж': 'j',
    u'з': 'z',
    u'и': 'u',
    u'і': 'i',
    u'ї': '',
    u'й': '',
    u'к': 'k',
    u'л': 'l',
    u'м': 'm',
    u'н': 'h',
    u'о': 'o',
    u'п': 'p',
    u'р': 'p',
    u'с': 'c',
    u'т': 't',
    u'у': 'y',
    u'ф': 'f',
    u'х': 'x',
    u'ц': 'c',
    u'ч': '',
    u'ш': '',
    u'щ': '',
    u'ь': '',
    u'ю': 'u',
    u'я': ''
}

ADDITIONAL_CODES_MAX_LENGTH = 2700
